Конфигурация/Проверка/Documents/ЧекККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЧекККМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиПоДисконтнымКартам</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КассоваяСмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЧекаККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АкцизнаяМарка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Проверка/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Проверка/Enums/СтатусыЧекаККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЧекаККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пробит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеФискальный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Проверка/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУКТЗЕД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетАкцизнуюМарку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Штрихкоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Проверка/Documents/ЧекККМ/Forms/ФормаДокумента/Ext/Form/Module.bsl
// --- 1. ОБРАБОТЧИКИ СОБЫТИЙ ШАПКИ И ТАБЛИЦ ---

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено И ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
		
		// 1. Получаем данные товара
		ДанныеТовара = ПолучитьДанныеНоменклатурыНаСервере(ТекСтрока.Номенклатура, Объект.Склад, Объект.Дата);
		
		ТекСтрока.Цена = ДанныеТовара.Цена;
		ТекСтрока.НалоговаяГруппа = ДанныеТовара.НалоговаяГруппа;
		ТекСтрока.Количество = 1;
		
		// 2. Логика Маркировки (АСИНХРОННО)
		Если ДанныеТовара.ТребуетМарку Тогда
			
			Подсказка = "Товар """ + ТекСтрока.Номенклатура + """ требует акцизную марку! Отсканируйте DataMatrix:";
			
			// Передаем текущую строку в параметры, чтобы обработчик знал, куда писать марку
			ПараметрыОповещения = Новый Структура("СтрокаТаблицы", ТекСтрока);
			Оповещение = Новый ОписаниеОповещения("ВводМаркиЗавершение", ЭтотОбъект, ПараметрыОповещения);
			
			// Вызываем неблокирующее окно ввода
			ПоказатьВводСтроки(Оповещение, "", Подсказка, 0, Истина);
			
		Иначе
			// Если марка не нужна, сразу считаем
			РассчитатьСтроку(ТекСтрока);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводМаркиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекСтрока = ДополнительныеПараметры.СтрокаТаблицы;
	
	// Результат = Неопределено, если нажали Отмена
	Если Результат <> Неопределено Тогда
		
		ТекСтрока.АкцизнаяМарка = Результат;
		РассчитатьСтроку(ТекСтрока);
		
	Иначе
		
		// Если отказались вводить марку - очищаем строку
		ТекСтрока.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		ТекСтрока.Количество = 0;
		ТекСтрока.Цена = 0;
		ТекСтрока.Сумма = 0;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ввод марки отменен. Товар удален из строки.";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РассчитатьСтроку(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РассчитатьСтроку(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

// --- 2. РАСЧЕТНЫЕ ФУНКЦИИ ---

&НаКлиенте
Процедура РассчитатьСтроку(СтрокаТЧ)
	
	// Сумма = Цена * Кол-во - Скидка
	СтрокаТЧ.Сумма = (СтрокаТЧ.Цена * СтрокаТЧ.Количество) - СтрокаТЧ.СуммаСкидки;
	
	РассчитатьИтогиДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтогиДокумента()
	
	Объект.СуммаДокумента = 0;
	
	Для Каждого Стр Из Объект.Товары Цикл
		Объект.СуммаДокумента = Объект.СуммаДокумента + Стр.Сумма;
	КонецЦикла;
	
КонецПроцедуры

// --- 3. ПОМОЩНИКИ ОПЛАТЫ ---

&НаКлиенте
Процедура ОплатитьНаличными(Команда)
	ДобавитьОплату(ПредопределенноеЗначение("Перечисление.ВидыОплаты.Наличные"));
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьКартой(Команда)
	ДобавитьОплату(ПредопределенноеЗначение("Перечисление.ВидыОплаты.Безналичные"));
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОплату(ВидОплаты)
	
	// Считаем сколько еще осталось оплатить
	УжеОплачено = 0;
	Для Каждого Стр Из Объект.Оплата Цикл
		УжеОплачено = УжеОплачено + Стр.Сумма;
	КонецЦикла;
	
	ОстатокКДоплате = Объект.СуммаДокумента - УжеОплачено;
	
	Если ОстатокКДоплате <= 0 Тогда
		Сообщить("Вся сумма уже распределена!");
		Возврат;
	КонецЕсли;
	
	НоваяОплата = Объект.Оплата.Добавить();
	НоваяОплата.ВидОплаты = ВидОплаты;
	НоваяОплата.Сумма = ОстатокКДоплате;
	
КонецПроцедуры

// --- 4. ПРОВЕРКА ПЕРЕД ЗАПИСЬЮ (ВАЛИДАЦИЯ) ---

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи, РежимЗаписи)
	
	// Если просто записываем (не проводим), проверки не нужны
	Если РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Возврат;
	КонецЕсли;
	
	// 1. Проверка сумм
	СуммаОплат = 0;
	Для Каждого Стр Из Объект.Оплата Цикл
		СуммаОплат = СуммаОплат + Стр.Сумма;
	КонецЦикла;
	
	Если СуммаОплат < Объект.СуммаДокумента Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Недостаточно средств оплаты! Внесено: " + СуммаОплат + ", Требуется: " + Объект.СуммаДокумента;
		Сообщение.Сообщить();
	КонецЕсли;
	
	// 2. Статус
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЧекаККМ.Аннулирован") Тогда
		Отказ = Истина;
		Сообщить("Нельзя провести аннулированный чек!");
	КонецЕсли;
	
	// При проведении статус автоматически становится "Пробит"
	Если Не Отказ Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЧекаККМ.Пробит");
	КонецЕсли;
	
КонецПроцедуры

// --- 5. СЕРВЕРНЫЕ ЗАПРОСЫ ---

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатурыНаСервере(Номенклатура, Склад, ДатаДок)
	
	Результат = Новый Структура("Цена, ТребуетМарку, НалоговаяГруппа", 0, Ложь, Неопределено);
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Результат;
	КонецЕсли;
	
	// 1. Читаем реквизиты самого товара
	Результат.ТребуетМарку = Номенклатура.ТребуетАкцизнуюМарку;
	Результат.НалоговаяГруппа = Номенклатура.НалоговаяГруппа;
	
	// 2. Получаем цену (Срез последних)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";
		
	Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(ДатаДок), ДатаДок, ТекущаяДата()));
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.Цена = Выборка.Цена;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
